Trash/wingMotion2D_pimpleFoam_v3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;
startTime       4.9849800000e+00;
stopAt          endTime;
endTime         5.0000000000e+00;

deltaT          7e-5;

writeControl    timeStep;
writeInterval   286;

purgeWrite      0;
writeFormat     binary;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;
maxCo           2;

libs
(
    "libfvMotionSolvers.so"
);

functions
{
    forces
    {
        type                forces;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       1;
        patches             (wing_main flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              1.225;
        CofR                (0.25 0.007 0.125);
    }

    forceCoeffs
    {
        type                forceCoeffs;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       1;
        patches             (wing_main flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              1.225;
        magUInf             80;
        lRef                1;
        Aref                0.05;
        CofR                (0.25 0.007 0.125);
        liftDir             (0 1 0);
        dragDir             (1 0 0);
        pitchAxis           (0 0 1);
    }
}

// ************************************************************************* //
