Trash/wingMotion2D_pimpleFoam_v3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    topAndBottom
    {
        type            patch;
        nFaces          480;
        startFace       210727;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       211207;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       211327;
    }
    wing_main
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          593;
        startFace       211447;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       212040;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          105248;
        startFace       212240;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          105248;
        startFace       317488;
    }
)

// ************************************************************************* //
