Trash/wingMotion2D_pimpleFoam_v3/0.orig/include/fixedInletU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Cosine-gust inlet BC — auto-generated by cosim_driver.py (do not edit manually)
// Gust parameters:  U_INF=80.0 m/s  Wg0=60.0 m/s
//                   t_start=0.0 s  T_g=0.8 s  t_end=0.8 s

inlet
{
    type        codedFixedValue;
    value       uniform (80.0000 0 0);
    name        gustInlet;
    code
    #{
        const scalar t    = this->db().time().value();
        const scalar U0   = 80.0000;
        const scalar Wg0  = 60.0000;
        const scalar t0   = 0.000000;
        const scalar Tg   = 0.800000;
        scalar wy = 0.0;
        if (t >= t0 && t <= t0 + Tg)
        {
            wy = 0.5*Wg0*(1.0 - Foam::cos(2.0*Foam::constant::mathematical::pi*(t - t0)/Tg));
        }
        operator==(vector(U0, wy, 0.0));
    #};
}

// ************************************************************************* //
